princeton/users/mshahbaz/results/comparative_analysis_cpu_100.bak/httperf_unbalance_wlc_to3_fdb_rate_256_cpu_100/httperf_client_111.log
httperf --verbose --hog --timeout=3 --client=0/1 --server=172.17.60.201 --port=80 --uri=/ --rate=16 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
httperf: maximum number of open descriptors = 4096
Maximum connect burst length: 1

Connection lifetime histogram (time in ms):
             :
             6.5 1
             7.5 17
             8.5 12
             9.5 6
            10.5 8
            11.5 5
            12.5 4
            13.5 7
            14.5 5
            15.5 8
            16.5 7
            17.5 6
            18.5 3
            19.5 8
            20.5 8
            21.5 6
            22.5 4
            23.5 4
            24.5 1
            25.5 6
            26.5 5
            27.5 3
            28.5 3
            29.5 3
            30.5 2
            31.5 2
             :
            34.5 2
             :
            36.5 4
            37.5 3
             :
            39.5 1
            40.5 3
            41.5 1
            42.5 2
            43.5 2
            44.5 1
            45.5 1
            46.5 2
            47.5 1
             :
            49.5 1
            50.5 1
             :
            52.5 3
            53.5 2
            54.5 2
            55.5 1
            56.5 1
            57.5 1
            58.5 1
            59.5 1
            60.5 2
            61.5 2
             :
            63.5 1
            64.5 1
             :
            66.5 1
            67.5 2
             :
            74.5 1
             :
            78.5 1
            79.5 2
             :
            81.5 1
            82.5 2
            83.5 2
            84.5 1
             :
            89.5 3
             :
            91.5 1
             :
            93.5 1
            94.5 1
            95.5 1
             :
            98.5 1
            99.5 1
           100.5 1
             :
           103.5 1
           104.5 1
           105.5 1
             :
           108.5 1
             :
           110.5 1
             :
           115.5 3
           116.5 1
             :
           118.5 3
           119.5 1
             :
           121.5 1
             :
           125.5 1
             :
           127.5 1
             :
           134.5 1
           135.5 1
           136.5 1
             :
           138.5 2
             :
           141.5 1
           142.5 2
           143.5 1
             :
           146.5 3
           147.5 1
           148.5 1
           149.5 1
           150.5 2
             :
           153.5 1
             :
           156.5 2
             :
           161.5 1
           162.5 1
             :
           164.5 3
           165.5 2
             :
           172.5 1
             :
           174.5 2
             :
           176.5 1
           177.5 1
           178.5 1
             :
           180.5 2
             :
           183.5 1
           184.5 1
             :
           186.5 2
             :
           189.5 2
             :
           192.5 2
           193.5 1
             :
           195.5 1
           196.5 1
           197.5 2
           198.5 1
           199.5 1
             :
           201.5 1
           202.5 3
             :
           205.5 1
           206.5 1
           207.5 2
           208.5 1
           209.5 1
             :
           211.5 1
           212.5 2
             :
           216.5 2
             :
           218.5 1
             :
           221.5 1
           222.5 1
           223.5 1
             :
           226.5 1
           227.5 1
           228.5 1
             :
           231.5 1
           232.5 1
           233.5 2
           234.5 1
             :
           238.5 1
             :
           240.5 1
           241.5 2
           242.5 2
             :
           244.5 1
           245.5 1
             :
           250.5 1
             :
           253.5 1
           254.5 1
             :
           258.5 1
           259.5 1
             :
           261.5 2
           262.5 1
           263.5 1
           264.5 1
             :
           268.5 1
           269.5 3
           270.5 1
             :
           273.5 2
           274.5 2
           275.5 1
           276.5 2
             :
           278.5 1
           279.5 1
             :
           282.5 2
           283.5 2
             :
           285.5 1
           286.5 1
             :
           288.5 2
             :
           290.5 1
             :
           292.5 1
           293.5 1
           294.5 1
           295.5 3
           296.5 2
           297.5 1
             :
           300.5 1
             :
           302.5 1
           303.5 1
           304.5 2
           305.5 2
           306.5 1
           307.5 2
             :
           310.5 1
           311.5 4
             :
           315.5 2
             :
           318.5 3
           319.5 1
           320.5 3
             :
           324.5 1
           325.5 1
           326.5 1
             :
           331.5 1
             :
           333.5 1
           334.5 2
           335.5 1
           336.5 2
             :
           338.5 1
           339.5 1
           340.5 2
           341.5 2
           342.5 2
           343.5 1
             :
           345.5 1
           346.5 2
             :
           348.5 1
           349.5 3
           350.5 1
           351.5 3
             :
           353.5 3
           354.5 1
           355.5 3
             :
           359.5 1
             :
           361.5 1
             :
           366.5 3
           367.5 3
             :
           369.5 2
             :
           371.5 5
             :
           373.5 1
           374.5 1
           375.5 1
             :
           377.5 1
           378.5 1
           379.5 2
           380.5 1
           381.5 1
             :
           384.5 1
             :
           386.5 1
           387.5 1
           388.5 1
           389.5 1
           390.5 1
           391.5 1
           392.5 3
           393.5 1
           394.5 1
           395.5 2
           396.5 2
             :
           398.5 2
             :
           400.5 2
             :
           402.5 1
           403.5 2
           404.5 3
             :
           406.5 2
             :
           408.5 1
           409.5 2
           410.5 1
           411.5 3
           412.5 2
             :
           414.5 3
             :
           419.5 1
           420.5 1
             :
           423.5 1
           424.5 1
             :
           427.5 1
             :
           429.5 1
             :
           433.5 2
           434.5 1
           435.5 1
           436.5 1
           437.5 1
           438.5 1
             :
           441.5 1
           442.5 1
             :
           444.5 1
             :
           448.5 2
           449.5 1
             :
           451.5 2
           452.5 1
           453.5 1
             :
           455.5 2
             :
           457.5 1
           458.5 2
             :
           460.5 1
             :
           462.5 1
             :
           465.5 2
             :
           467.5 1
             :
           469.5 1
             :
           471.5 3
           472.5 2
           473.5 2
           474.5 1
           475.5 1
           476.5 2
             :
           479.5 1
             :
           481.5 1
             :
           483.5 1
           484.5 1
             :
           487.5 2
           488.5 1
           489.5 2
           490.5 2
           491.5 2
             :
           494.5 1
           495.5 1
           496.5 1
           497.5 1
           498.5 1
           499.5 2
           500.5 1
           501.5 1
           502.5 2
           503.5 2
             :
           505.5 3
             :
           507.5 2
           508.5 1
           509.5 2
             :
           512.5 1
           513.5 2
             :
           515.5 2
           516.5 1
             :
           519.5 2
           520.5 1
           521.5 1
             :
           523.5 3
             :
           527.5 1
           528.5 1
             :
           531.5 2
           532.5 3
           533.5 2
             :
           537.5 5
           538.5 3
             :
           540.5 1
             :
           543.5 1
             :
           545.5 2
           546.5 2
           547.5 2
           548.5 1
           549.5 1
           550.5 3
           551.5 1
             :
           553.5 2
           554.5 1
           555.5 1
             :
           557.5 3
           558.5 1
           559.5 1
           560.5 1
           561.5 1
           562.5 4
           563.5 1
             :
           565.5 2
             :
           568.5 2
           569.5 2
           570.5 2
           571.5 2
           572.5 1
           573.5 4
           574.5 1
           575.5 4
             :
           577.5 1
           578.5 4
           579.5 1
           580.5 2
           581.5 1
           582.5 2
           583.5 2
           584.5 1
           585.5 2
           586.5 1
           587.5 1
           588.5 2
           589.5 1
           590.5 1
           591.5 1
           592.5 1
           593.5 1
             :
           595.5 2
           596.5 3
           597.5 1
           598.5 1
           599.5 2
             :
           601.5 1
             :
           604.5 2
           605.5 1
           606.5 2
           607.5 1
             :
           609.5 2
           610.5 1
           611.5 1
             :
           613.5 1
             :
           616.5 1
           617.5 2
             :
           619.5 2
             :
           621.5 2
             :
           623.5 2
             :
           625.5 2
           626.5 2
             :
           628.5 1
             :
           630.5 3
             :
           633.5 1
             :
           635.5 3
           636.5 1
             :
           638.5 2
           639.5 3
             :
           642.5 2
           643.5 1
             :
           645.5 3
             :
           648.5 2
           649.5 2
           650.5 1
           651.5 3
           652.5 1
           653.5 3
           654.5 2
           655.5 1
           656.5 3
             :
           659.5 2
             :
           662.5 1
             :
           664.5 1
           665.5 2
             :
           667.5 2
           668.5 1
             :
           671.5 1
             :
           675.5 1
           676.5 3
             :
           678.5 3
           679.5 1
             :
           681.5 1
           682.5 1
             :
           684.5 1
           685.5 1
             :
           687.5 2
             :
           690.5 1
           691.5 1
           692.5 1
             :
           694.5 2
           695.5 3
             :
           698.5 3
             :
           701.5 1
           702.5 1
           703.5 1
           704.5 2
           705.5 1
           706.5 1
             :
           709.5 4
             :
           711.5 2
           712.5 1
             :
           715.5 2
           716.5 1
             :
           718.5 1
             :
           721.5 2
             :
           723.5 1
           724.5 3
           725.5 1
           726.5 2
             :
           728.5 2
             :
           730.5 1
           731.5 1
             :
           735.5 1
           736.5 1
           737.5 1
             :
           744.5 1
             :
           750.5 1
             :
           754.5 1
             :
           756.5 1
           757.5 1
           758.5 3
           759.5 1
           760.5 1
           761.5 2
             :
           766.5 1
           767.5 2
             :
           769.5 1
             :
           772.5 1
             :
           776.5 1
           777.5 1
           778.5 2
           779.5 1
           780.5 2
             :
           782.5 1
             :
           787.5 1
             :
           789.5 1
             :
           791.5 2
           792.5 1
             :
           795.5 1
           796.5 1
           797.5 1
           798.5 1
             :
           801.5 2
           802.5 1
             :
           804.5 1
           805.5 1
           806.5 1
             :
           817.5 1
             :
           822.5 2
           823.5 1
           824.5 1
           825.5 1
           826.5 2
           827.5 3
             :
           829.5 3
             :
           831.5 1
             :
           833.5 1
           834.5 2
           835.5 1
             :
           837.5 1
             :
           839.5 1
             :
           841.5 1
           842.5 2
             :
           845.5 1
           846.5 1
           847.5 2
             :
           852.5 1
             :
           854.5 1
           855.5 1
             :
           857.5 1
             :
           861.5 2
             :
           864.5 1
           865.5 1
           866.5 1
             :
           871.5 2
             :
           874.5 1
             :
           877.5 1
             :
           881.5 1
             :
           887.5 2
           888.5 1
           889.5 2
           890.5 1
           891.5 1
             :
           894.5 1
             :
           897.5 1
             :
           903.5 1
             :
           910.5 1
             :
           913.5 1
             :
           916.5 1
             :
           918.5 1
           919.5 1
           920.5 1
             :
           922.5 2
           923.5 1
           924.5 1
           925.5 1
           926.5 1
             :
           930.5 1
             :
           932.5 1
             :
           934.5 1
           935.5 1
             :
           937.5 1
           938.5 1
             :
           944.5 1
           945.5 1
             :
           948.5 1
             :
           950.5 1
           951.5 1
           952.5 2
             :
           956.5 1
             :
           960.5 1
             :
           964.5 1
             :
           972.5 1
             :
           974.5 1
             :
           983.5 1
           984.5 1
             :
           990.5 1
             :
           993.5 1
             :
           998.5 2
           999.5 1
             :
          1006.5 1
             :
          1009.5 1
          1010.5 2
             :
          1015.5 1
             :
          1029.5 1
          1030.5 2
          1031.5 1
             :
          1049.5 1
             :
          1052.5 1
          1053.5 1
             :
          1056.5 1
             :
          1063.5 1
             :
          1074.5 1
             :
          1078.5 1
             :
          1085.5 1
          1086.5 1
             :
          1095.5 1
             :
          1101.5 1
             :
          1107.5 1
             :
          1110.5 1
             :
          1116.5 1
             :
          1126.5 1
             :
          1131.5 1
             :
          1136.5 1
             :
          1143.5 1
             :
          1149.5 1
             :
          1162.5 1
             :
          1170.5 1
          1171.5 1
             :
          1177.5 1
             :
          1182.5 1
             :
          1194.5 1
             :
          1214.5 1
             :
          1237.5 1
             :
          1266.5 1
             :
          1301.5 1
             :
          1311.5 1
             :
          1334.5 1
             :
          1430.5 1
             :
          1508.5 1
             :
          1511.5 1
             :
          1531.5 1
             :
          1569.5 1
             :
          1576.5 1
             :
          1579.5 2
             :
          1585.5 1
             :
          1633.5 1
             :
          1639.5 1
             :
          1674.5 1
             :
          1688.5 1
             :
          1701.5 1
             :
          1712.5 1
             :
          1714.5 1
             :
          1779.5 1
             :
          1795.5 1
             :
          1809.5 1
             :
          1901.5 1
             :
          1962.5 1
             :
          2006.5 1
             :
          2103.5 1
             :
          2267.5 1
             :
          2344.5 1
             :
          2358.5 1
             :
          2491.5 1
             :
          2901.5 1

Total: connections 1000 requests 1000 replies 1000 test-duration 63.132 s

Connection rate: 15.8 conn/s (63.1 ms/conn, <=15 concurrent connections)
Connection time [ms]: min 7.0 avg 477.0 max 2901.9 median 452.5 stddev 389.5
Connection time [ms]: connect 18.4
Connection length [replies/conn]: 1.000

Request rate: 15.8 req/s (63.1 ms/req)
Request size [B]: 66.0

Reply rate [replies/s]: min 11.0 avg 15.8 max 20.0 stddev 2.0 (63 samples)
Percentages of the replies served at a given rate:
   50%: 15
   66%: 16
   75%: 16
   80%: 17
   90%: 18
   95%: 18
   98%: 18
   99%: 19
  100%: 20

Reply time [ms]: response 455.3 transfer 3.2
Percentages of the requests served within a certain time (ms) :
   50%: 443
   66%: 582
   75%: 658
   80%: 710
   90%: 864
   95%: 995
   98%: 1175
   99%: 1578
  100%: 2893

Reply size [B]: header 167.0 content 59.0 footer 0.0 (total 226.0)
Reply status: 1xx=0 2xx=1000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 38.06 system 24.97 (user 60.3% system 39.6% total 99.8%)
Net I/O: 4.5 KB/s (0.0*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0